gotyuo/esp32-wsd/firmware/releases/v2.0.0/src_esp8266_tft_v2/mqtt_mgr.cpp
// ============================================================
// MQTT 管理 ESP8266
// ============================================================
#include "mqtt_mgr.h"
#include "mqtt_client.h"
#include <ESP8266WiFi.h>

static MqttClient client;
static WiFiClient net;
static char topicTele[64];
static char topicStat[64];
static char topicCfg[80];

MqttMgr g_mqtt;

void MqttMgr::begin() {
    snprintf(topicTele, sizeof(topicTele), "envmon/%s/telemetry", g_cfg.device_id);
    snprintf(topicStat, sizeof(topicStat), "envmon/%s/status",    g_cfg.device_id);
    snprintf(topicCfg,  sizeof(topicCfg),  "envmon/%s/config",   g_cfg.device_id);

    client.setClient(&net);
    client.setCallback([](const char *topic, const uint8_t *payload, size_t len) {
        if (strcmp(topic, topicCfg) != 0) return;
        String json;
        json.reserve(len);
        for (size_t i = 0; i < len; i++) json += (char)payload[i];
        g_mqtt.applyConfig(json);
    });
}

bool MqttMgr::connected() const {
    return client.connected();
}

bool MqttMgr::doConnect() {
    Serial.printf("[MQTT] %s:%d\n", g_cfg.mqtt_host, g_cfg.mqtt_port);
    bool ok = client.connect(g_cfg.mqtt_host, g_cfg.mqtt_port, g_cfg.device_id,
                              g_cfg.mqtt_user, g_cfg.mqtt_pass,
                              topicStat, "offline", 30);
    if (ok) {
        Serial.println(F("[MQTT] Connected"));
        client.publish(topicStat, "online", 6, true, 0);
        client.subscribe(topicCfg, 1);
    } else {
        Serial.printf("[MQTT] Failed state=%d\n", client.state());
    }
    return ok;
}

void MqttMgr::ensureConn() {
    if (client.connected()) return;
    uint32_t now = millis();
    if (now - _lastTry < _retryDelay) return;
    _lastTry = now;
    _retryDelay = min((uint32_t)60000, _retryDelay * 2);
    doConnect();
}

void MqttMgr::loop() {
    if (!g_cfg.has_mqtt() || WiFi.status() != WL_CONNECTED) return;
    ensureConn();
    client.loop();
}

bool MqttMgr::publishTelemetry(const EnvData &d, int alarm_level) {
    if (!client.connected()) return false;
    uint32_t seq = (uint32_t)(millis() / 1000);
    char ip[16];
    IPAddress addr = WiFi.localIP();
    snprintf(ip, sizeof(ip), "%d.%d.%d.%d", addr[0], addr[1], addr[2], addr[3]);

    char buf[320];
    snprintf(buf, sizeof(buf),
        "{\"device_id\":\"%s\""
        ",\"seq\":%lu"
        ",\"t\":%s,\"h\":%s,\"p\":%s"
        ",\"sp_o2\":%s,\"pr\":%s"
        ",\"rssi\":%d,\"uptime\":%lu,\"alarm\":%d"
        ",\"fw\":\"%s\",\"heap\":%u,\"ip\":\"%s\"}",
        g_cfg.device_id,
        (unsigned long)seq,
        isnan(d.temp_c)   ? "null" : String(d.temp_c, 2).c_str(),
        isnan(d.hum_pct)  ? "null" : String(d.hum_pct, 2).c_str(),
        isnan(d.pres_hpa) ? "null" : String(d.pres_hpa, 2).c_str(),
        isnan(d.sp_o2)    ? "null" : String(d.sp_o2, 0).c_str(),
        isnan(d.pr_hr)    ? "null" : String(d.pr_hr, 0).c_str(),
        WiFi.RSSI(),
        (unsigned long)(millis() / 1000),
        alarm_level,
        FW_VERSION,
        (unsigned)ESP.getFreeHeap(),
        ip);
    return client.publish(topicTele, buf, strlen(buf), false, 0);
}

void MqttMgr::applyConfig(const String &json) {
    Serial.printf("[MQTT] Config: %s\n", json.c_str());
}